Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: If the What parameter specifies the name of a running function, File and Line are now set based on which line called that function.
ja: Whatパラメータで実行中の関数名を指定した場合、Fileと Lineは、どの行からその関数が呼び出されたかに基づいて設定されるようになりました。

source: If the Try statement completes without an exception being thrown (and without control being transferred elsewhere by Return, Break or similar), the Else statement is executed.
ja: 例外がスローされることなく（ReturnやBreakなどで制御が他に移ることなく）Try文が完了すると、Else文が実行される。

source: If the E option is present, single character key names are interpreted as characters instead, and in those cases the modifier keys must be in the correct state to produce that character.
ja: Eオプションがある場合、1文字のキー名は代わりに文字として解釈され、その場合、修飾キーがその文字を生成するために正しい状態でなければなりません。

source: If the C option is also used, the end character is case-sensitive.
ja: Cオプションも使用した場合、終了文字の大文字と小文字は区別されます。

source: If the C option is in effect, the case of items must match for them to be considered identical.
ja: Cオプションが有効な場合、同一とみなされるためには、項目の大文字と小文字が一致しなければならない。

source: If the CPU is slow or under load, or if window animation is enabled, higher delay values may be needed.
ja: CPUが遅い場合や負荷が高い場合、ウィンドウアニメーションが有効な場合は、より高い遅延値が必要になる場合があります。

source: If the File object was created from a handle to a non-seeking device such as a console buffer or pipe, omitting this parameter may cause the method to fail or return only what data is currently available.
ja: Fileオブジェクトがコンソールバッファやパイプなどの非シーキングデバイスへのハンドルから作成された場合、このパラメータを省略すると、メソッドが失敗するか、現在利用可能なデータのみを返すことがあります。

source: If the File object was created from a handle to a non-seeking device such as a console buffer or pipe, the returned value may not be meaningful, as such devices do not logically have an "end of file".
ja: Fileオブジェクトがコンソールバッファやパイプなどの非シーキングデバイスへのハンドルから作成された場合、そのようなデバイスは論理的に「ファイルの終わり」を持たないため、戻り値は意味をなさないかもしれません。

source: If the File object was created from a handle to a pipe, it may return the amount of data currently available in the pipe's internal buffer, but this behaviour is not guaranteed.
ja: Fileオブジェクトがパイプへのハンドルから生成された場合、パイプの内部バッファで現在利用可能なデータ量を返すかもしれませんが、この動作は保証されていません。

source: If the GUI has an event sink (that is, if Gui()'s EventObj parameter was specified), this parameter may be the name of a method belonging to the event sink.
ja: GUIにイベントシンクがある場合（つまりGui()のEventObjパラメータが指定されている場合）、このパラメータはイベントシンクに属するメソッドの名前になります。

source: If the INI section starts with /* and ends with */ as shown above, it is not included in the created file.
ja: 上記のように、INIセクションが/*で始まり、*/で終わる場合、作成されたファイルには含まれない。

source: If the Input is in progress, EndReason is blank.
ja: 入力中の場合、EndReason は空白となります。

source: If the ListView is created with a view mode other than report view, the control is sized to fit rows of icons instead of rows of text.
ja: レポートビュー以外のビューモードでListViewを作成した場合、コントロールはテキストの列ではなく、アイコンの列に合うようにサイズ調整されます。

source: If the M option (multi-select) is in effect, this function returns an array of items, where each item is the full path and name of a single file.
ja: Mオプション（複数選択）が有効な場合、この関数は項目の配列を返し、各項目は1つのファイルのフルパスと名前になります。

source: If the N option is in effect, an item such as 2 would be considered a duplicate of 2.0.
ja: Nオプションが有効な場合、2のような項目は2.0と重複しているとみなされる。

source: If the OnExit thread encounters a failure condition such as a runtime error, the script will terminate.
ja: OnExitスレッドがランタイムエラーなどの失敗条件に遭遇した場合、スクリプトは終了します。

source: If the OnExit thread was launched due to an Exit or ExitApp function that specified an exit code, that exit code is used unless an OnExit function returns true (preventing exit) or calls ExitApp.
ja: OnExitスレッドが、終了コードを指定したExitまたはExitApp関数によって起動された場合、OnExit関数がtrueを返すか（終了を阻止する）ExitAppを呼び出さない限り、その終了コードが使用されます。

source: If the P option is omitted when creating a hotkey, 0 will be used.
ja: ホットキー作成時にPオプションが省略された場合は、0が使用されます。

source: If the Program does not specify a version number of this License, you may choose any version ever published by the Free Software Foundation.
ja: プログラムが本許諾書のバージョン番号を指定していない場合、あなたはフリーソフ トウェア財団がこれまでに発行したどのバージョンでも選択することができる。

source: If the Program specifies a version number of this License which applies to it and "any later version", you have the option of following the terms and conditions either of that version or of any later version published by the Free Software Foundation.
ja: プログラムにおいて、本許諾書と「それ以降のバージョン」に適用される本 許諾書のバージョン番号が指定されている場合、あなたはそのバージョンか、フリーソ フトウェア財団によって発行されたそれ以降のバージョンのいずれかの条項と条 件に従うことができる。

source: If the Random option or custom sorting is in effect, duplicates are removed only if they appear adjacent to each other as a result of the sort.
ja: ランダム・オプションまたはカスタム・ソートが有効な場合、重複は、ソートの結果、隣接して表示された場合にのみ削除される。

source: If the RegEx title matching mode is active, ProcessNameOrPath accepts a regular expression which must match the full path of the process.
ja: RegExタイトル・マッチング・モードが有効な場合、ProcessNameOrPathは、プロセスのフル・パスにマッチしなければならない正規表現を受け付ける。

source: If the RegEx title matching mode is active, ClassName accepts a regular expression.
ja: RegExタイトル・マッチ・モードが有効な場合、ClassNameは正規表現を受け付けます。

source: If the X and Y coordinates caused the tooltip to run off-screen, or outside the monitor's working area on Windows 8 or later, it is repositioned to be entirely visible.
ja: X座標とY座標が原因でツールチップが画面の外に出ていた場合、またはWindows 8以降でモニタの作業領域の外に出ていた場合、ツールチップは完全に見えるように再配置されます。

source: If the Z option is not present, the last linefeed (`n) is considered to be part of the last item, and thus there are only 3 items.
ja: Zオプションがない場合、最後の改行(`n)は最後の項目の一部とみなされるため、項目は3つしかありません。

source: If the absolute value of StartingPos is greater than the length of Haystack, 0 is returned.
ja: StartingPosの絶対値がHaystackの長さより大きいときは、0 が返されます。

source: If the active window changes but reverts before any characters are typed, the change is not detected (but the hotstring recognizer may be reset for some other reason).
ja: アクティブウィンドウが変更され、文字が入力される前に元に戻った場合、変更は検出されません（ただし、他の理由でホットストリング認識装置がリセットされる場合があります）。

source: If the active window is a qualified match, the Last Found Window will be updated to be the active window.
ja: アクティブなウィンドウが適格に一致する場合、Last Found Windowはアクティブなウィンドウに更新されます。

source: If the active window is hidden and DetectHiddenWindows is turned off, it is never considered a match.
ja: アクティブ・ウィンドウが非表示で、DetectHiddenWindowsがオフになっている場合、マッチするとはみなされない。

source: If the active window matches the criteria, it usually takes precedence since it is usually above all other windows.
ja: アクティブなウィンドウが条件に一致する場合、通常は他のすべてのウィンドウより上にあるため、そのウィンドウが優先される。

source: If the active window satisfies the function's expectation, the function will not wait for Timeout to expire.
ja: アクティブウィンドウが関数の期待値を満たしている場合、関数はタイムアウトまで待ちません。

source: If the alt-tab menu is visible, move forward in it.
ja: alt-tabメニューが表示されている場合は、その中を進んでください。

source: If the array is empty (Length is 0), an Error is thrown.
ja: 配列が空の場合（Lengthが0）、エラーとなる。

source: If the asterisk is present, upward navigation may optionally be restricted to a folder other than Desktop.
ja: アスタリスクがある場合、オプションで上方向のナビゲーションがデスクトップ以外のフォルダーに制限されることがあります。

source: If the bitmap is too large, it will be clipped.
ja: ビットマップが大きすぎると、クリップされる。

source: If the buffer contains data read from file, it is discarded and the actual file pointer is reset to the logical position indicated by FileObj.Pos.
ja: バッファにファイルから読み込んだデータが含まれている場合は破棄され、実際のファイルポインタはFileObj.Posで示される論理位置にリセットされます。

source: If the button is in a dialog box, the user can select the button by pressing Enter, even when the button does not have the input focus.
ja: ボタンがダイアログボックス内にある場合、ボタンに入力フォーカスがなくても、ユーザーはEnterキーを押すことでボタンを選択することができます。

source: If the callback is a method registered by name, its hidden this parameter seamlessly receives the event sink object (that is, the object to which the method belongs).
ja: コールバックが名前で登録されたメソッドである場合、その隠されたこのパラメータはシームレスにイベントシンクオブジェクト（つまり、そのメソッドが属するオブジェクト）を受け取ります。

source: If the called function modifies the string and the argument is a naked variable or VarRef, its contents will be updated.
ja: 呼び出された関数が文字列を変更し、引数が裸の変数または VarRef である場合、その内容が更新されます。

source: If the calling process is associated with a Terminal Services client session, the return value is nonzero.
ja: 呼び出し元のプロセスがターミナルサービスのクライアントセッションに関連付けられている場合、戻り値はゼロ以外です。

source: If the calling process is associated with the Terminal Server console session, the return value is zero.
ja: 呼び出し元のプロセスがターミナルサーバーのコンソールセッションに関連付けられている場合、戻り値は0です。

source: If the capacity is too large, some of the memory is wasted, but only temporarily because all the memory can be freed after the operation by means of VarSetStrCapacity(&Var, 0) or Var := "".
ja: 容量が大きすぎる場合、メモリの一部が無駄になるが、VarSetStrCapacity(&Var, 0)またはVar := ""によって操作後にすべてのメモリを解放できるため、一時的なものに過ぎない。

source: If the class defines or inherits a static __New method, it is called immediately after __Init.
ja: クラスがstatic __Newメソッドを定義または継承している場合、 __Init の直後に呼び出されます。

source: If the class is not referenced sooner, they are evaluated when the class definition is reached during execution, so initialization of global variables can occur first, without putting them into a class.
ja: クラスがすぐに参照されない場合は、実行中にクラス定義に到達した時点で評価されるため、グローバル変数の初期化は、クラスに入れずに最初に行うことができます。

source: If the clipboard changes while a callback is already running, that notification event is lost.
ja: コールバックの実行中にクリップボードが変更されたときは、その通知イベントは失われます。

source: If the clipboard changes while an OnClipboardChange function is already running, that notification event is lost.
ja: OnClipboardChange関数がすでに実行されている間にクリップボードが変更された場合、その通知イベントは失われます。

source: If the clipboard contained more than one format (which is almost always the case), these three items are repeated until all the formats are included.
ja: クリップボードに複数のフォーマットが含まれている場合（ほとんどの場合）、すべてのフォーマットが含まれるまで、これら3つの項目が繰り返されます。

source: If the code is intended to be unreachable - such as if a return has been used to temporarily disable a block of code, or a hotkey or hotstring has been temporarily disabled by commenting it out - consider commenting out the unreachable code as well.
ja: コードが到達できないことを意図している場合（例えば、returnによってコードのブロックを一時的に無効にした場合、またはホットキーやホットストリングをコメントアウトすることによって一時的に無効にした場合）、到達できないコードもコメントアウトすることを検討してください。

source: If the command's first parameter is an output variable and the second parameter is not, it becomes the return value and is removed from the parameter list.
ja: コマンドの第1パラメータが出力変数で、第2パラメータが出力変数でない場合、そのパラメータは戻り値となり、パラメータリストから削除されます。

source: If the computer has more than one joystick and you want to use one beyond the first, include the joystick number (max 16) in front of the control name.
ja: コンピュータに複数のジョイスティックがあり、最初のジョイスティック以外のものを使いたい場合は、コントロール名の前にジョイスティック番号（最大16）を入れてください。

source: If the computer is connected to the Internet through a router, this will not include the computer's public (Internet) IP address.
ja: コンピューターがルーターを経由してインターネットに接続されている場合、これにはコンピューターのパブリック（インターネット）IPアドレスは含まれません。

source: If the computer lacks a sound card, a standard beep is played through the PC speaker.
ja: コンピュータにサウンドカードがない場合、標準的なビープ音がパソコンのスピーカーから再生されます。

source: If the control cannot be determined, this variable will be made blank.
ja: 制御が決定できない場合は、この変数を空白とします。

source: If the control contains a single line of text, the text is centered vertically within the available height of the control.
ja: コントロールが1行のテキストを含む場合、テキストはコントロールの利用可能な高さの範囲内で垂直方向にセンタリングされる。

source: If the control has no visible caption text and no (single) text value, this property corresponds to the control's hidden caption text (like ControlGetText/ControlSetText).
ja: コントロールに可視キャプションテキストがなく、（単一の）テキスト値もない場合、このプロパティはコントロールの非表示キャプションテキストに対応します（ControlGetText/ControlSetTextのように）。

source: If the control has word-wrapping enabled (which is the default for multi-line edit controls), any wrapping that occurs as the user types will not produce linefeed characters (only Enter can do that).
ja: コントロールがワードラッピングを有効にしている場合（複数行編集コントロールのデフォルト）、ユーザーが入力する際に発生するラップは、改行文字を生成しません（Enterだけがそれを行うことができます）。

source: If the control is not value-capable, CurrentValue will be blank and assigning NewValue will raise an error.
ja: コントロールが値対応でない場合、CurrentValueは空白となり、NewValueの代入はエラーとなります。

source: If the control is not value-capable, RetrievedValue will be blank and assigning NewValue will raise an error.
ja: コントロールが値対応でない場合、RetrievedValueは空白となり、NewValueの代入はエラーとなります。

source: If the control lacks a small-icon ImageList, no icon is displayed nor is any space reserved for one in report view.
ja: コントロールに小さいアイコンの ImageList がない場合、アイコンは表示されず、レポートビューにアイコンのためのスペースも確保されません。

source: If the control lacks an ImageList, no icon is displayed nor is any space reserved for one.
ja: コントロールにイメージリストがない場合、アイコンは表示されず、アイコンのためのスペースも確保されません。

source: If the current active window is the only match, the return value is 0.
ja: 現在のアクティブなウィンドウが唯一の一致である場合、戻り値は 0 です。

source: If the current executable file does not have an embedded script, this switch is permitted but has no effect.
ja: 現在の実行ファイルにスクリプトが埋め込まれていない場合、このスイッチは許可されるが、何の効果もない。

source: If the current executable file has embedded scripts, this parameter can be an asterisk followed by the resource name or ID of an embedded script.
ja: 現在の実行ファイルにスクリプトが埋め込まれている場合、このパラメータには、アスタリスクの後に埋め込みスクリプトのリソース名またはIDを付けることができる。

source: If the current function is nested inside another function, static variables of each outer function are also listed.
ja: 現在の関数が他の関数の中にネストされている場合、各外部関数の静的変数もリストアップされます。

source: If the current item is a key, an exception is thrown and the registry is not modified.
ja: 現在の項目がキーの場合、例外が発生し、レジストリは変更されません。

source: If the current item is a key, an exception is thrown.
ja: 現在の項目がキーである場合、例外が発生します。

source: If the current item is a key, its default value will be deleted instead.
ja: 現在の項目がキーの場合、そのデフォルト値が代わりに削除されます。

source: If the current item is a value, the key which contains that value will be deleted, including all subkeys and values.
ja: 現在の項目が値の場合、その値を含むキーは、すべてのサブキーと値を含めて削除されます。

source: If the current loop reg item is a subkey, ValueName defaults to empty (the subkey's default value) and ValueType must be specified.
ja: 現在のループREG項目がサブキーの場合、ValueNameのデフォルトは空（サブキーのデフォルト値）、ValueTypeの指定が必要です。

source: If the current loop reg item is a value, ValueName and ValueType default to that value's name and type, but one or both can be overridden.
ja: 現在のループREGアイテムが値の場合、ValueNameと ValueTypeのデフォルトはその値の名前と型であるが、一方または両方をオーバーライドすることができる。

source: If the current user has admin rights, this variable contains 1.
ja: 現在のユーザーに管理者権限がある場合、この変数には1が格納される。

source: If the data is not UTF-16 text, this conversion generally changes the data in undesired ways.
ja: データがUTF-16テキストでない場合、この変換は一般的に望ましくない方法でデータを変更します。

source: If the default item is deleted, the menu is left without one.
ja: デフォルトの項目が削除された場合、メニューには何もない状態になります。

source: If the destination directory structure doesn't exist it will be created if possible.
ja: 保存先のディレクトリ構造が存在しない場合は、可能であれば作成されます。

source: If the dialog could not be displayed, an empty string is returned.
ja: ダイアログを表示できなかった場合は、空文字列が返されます。

source: If the enumerator is user-defined and the parameter is mandatory, an exception is thrown as usual.
ja: 列挙者がユーザー定義で、パラメータが必須である場合は、通常通り例外が発生します。

source: If the enumerator returns more than one value per iteration, only the first value is used.
ja: 列挙者が1回の反復で複数の値を返す場合、最初の値のみが使用されます。

source: If the error was raised by a built-in function, continuing causes it to return "".
ja: エラーが組み込み関数によって発生した場合、その関数を継続すると""が返されます。

source: If the error was raised by the expression evaluator (such as for an invalid dynamic reference or divide by zero), the expression is aborted and yields "" (if used as a control flow statement's parameter).
ja: 式評価器でエラーが発生した場合（無効な動的参照やゼロ除算など）、式は中断され、""（制御フロー文のパラメータとして使用された場合）が出力されます。

source: If the event has no parameters, Params should be omitted entirely.
ja: イベントにパラメータがない場合、Paramsは完全に省略されるべきです。

source: If the example above came from v1 (rather than v2.0-a033 - v2.0-a136), the new code should be InStr(a, b, -2, -2).
ja: 上の例がv1（v2.0-a033～v2.0-a136ではなく）のものであれば、新しいコードはInStr(a, b, -2, -2)になるはずです。

source: If the executable (EXE) that is running the script is 32-bit, A_ProgramFiles returns the path of the "Program Files (x86)" directory.
ja: スクリプトを実行している実行ファイル（EXE）が 32 ビットの場合、A_ProgramFiles は「Program Files (x86)」ディレクトリのパスを返します。

source: If the expression evaluates to true, the hotkey's action is executed.
ja: 式がtrueと評価された場合、そのホットキーの動作が実行されます。

source: If the expression evaluates to false (which is an empty string or the number 0), the loop continues; otherwise, the loop is broken and execution continues at the line following Until.
ja: この式がfalse（空文字列または数値0）と評価されたときはループは続行されます。そうでないときはループは解除されてUntilに続く行で実行が続行されます。

source: If the expression evaluates to true (which is any result other than an empty string or the number 0), the body of the loop is executed; otherwise, execution jumps to the line following the loop's body.
ja: この式がtrueと評価された場合（空文字列や数値0以外の結果）、ループの本体が実行され、そうでない場合はループの本体に続く行にジャンプする。

source: If the expression meets these criteria, it is evaluated directly by the program and does not appear in ListLines.
ja: これらの条件を満たす式は、プログラムによって直接評価され、ListLinesには表示されません。

source: If the file already exists, it will be overwritten.
ja: ファイルがすでに存在する場合は、上書きされます。

source: If the file begins with a UTF-8 or UTF-16 (LE) byte order mark, the appropriate codepage is used and the /CPn switch is ignored.
ja: ファイルがUTF-8またはUTF-16（LE）のバイトオーダーマークで始まる場合、適切なコードページが使用され、/CPnスイッチは無視される。

source: If the file cannot be opened, an OSError is thrown.
ja: ファイルを開くことができない場合は、OSErrorが投げられる。

source: If the file does not exist or cannot be opened for any other reason, an empty string is returned.
ja: ファイルが存在しないか、その他の理由でオープンできない場合は、空文字列が返されます。

source: If the file doesn't have one (due to the long name being shorter than 8.3 or perhaps because short-name generation is disabled on an NTFS file system), A_LoopFileName will be retrieved instead.
ja: ファイルに名前がない場合（長い名前が8.3より短いか、NTFSファイルシステムで短縮名の生成が無効になっているため）、代わりにA_LoopFileNameが取得されます。

source: If the file has no attributes (rare), "X" is returned.
ja: ファイルに属性がない場合（稀）には、「X」が返されます。

source: If the file is larger than this, only its leading part is loaded.
ja: これより大きなファイルの場合は、その先頭部分のみを読み込みます。

source: If the file is on a local or mapped drive, the variable will be set to the drive letter followed by a colon (no backslash).
ja: ファイルがローカルまたはマップされたドライブにある場合、変数にはドライブ文字に続いてコロン（バックスラッシュなし）が設定される。

source: If the file is on a network path (UNC), the variable will be set to the share name, e.g. \\Workstation01
ja: ファイルがネットワークパス（UNC）上にある場合、変数には共有名が設定される、例：\\Workstation01

source: If the first control in the window is disabled (possibly depending on control type), the Escape event will not be launched.
ja: ウィンドウの最初のコントロールが無効になっている場合（コントロールの種類によって異なる可能性があります）、Escapeイベントは起動されません。

source: If the first line mixes spaces and tabs, only the first type of character is treated as indentation.
ja: 最初の行にスペースとタブが混在している場合、最初の種類の文字だけがインデントとして扱われます。

source: If the flag is set, the BSTR is freed when the wrapper object is freed.
ja: このフラグが設定されている場合、BSTRはラッパーオブジェクトが解放される際に解放されます。

source: If the flag is set, the SafeArray is destroyed when the wrapper object is freed.
ja: このフラグが設定されている場合、SafeArrayはラッパーオブジェクトが解放される際に破棄されます。

source: If the flow of execution within a function reaches the function's closing brace prior to encountering a Return, the function ends and returns a blank value (empty string) to its caller.
ja: 関数内の実行の流れがReturnに出会う前に関数の閉じブレースに到達した場合、関数は終了し、呼び出し元に空白の値（空文字列）を返します。

source: If the function case_conform_btw is ever called explicitly by the script, the first parameter (hs) must be passed a value.
ja: 関数case_conform_btwがスクリプトによって明示的に呼び出されることがある場合、最初のパラメータ（hs）には値を渡さなければならない。

source: If the function editor_open_folder is ever called explicitly by the script, the first parameter (hk) must be passed a value.
ja: 関数editor_open_folderがスクリプトから明示的に呼び出される場合、最初のパラメータ（hk）には値を渡さなければなりません。

source: If the function accepts a specific type of string as input, the script may use the appropriate string type:
ja: 関数が入力として特定のタイプの文字列を受け入れる場合、スクリプトは適切な文字列タイプを使用することができます：

source: If the function has a string parameter used for output, the script must allocate a buffer as described above and pass it to the function.
ja: 関数に出力用の文字列パラメータがある場合、スクリプトは上記のようにバッファを確保し、それを関数に渡す必要があります。

source: If the function is variadic, ParamCount indicates the maximum number of parameters which can be accepted by the function without overflowing into the "variadic*" parameter.
ja: 関数がバリアディックの場合、ParamCountは「バリアディック」（*）パラメータに溢れることなく関数が受け入れることができるパラメータの最大数を示します。

source: If the function is designed to store a string longer than the parameter's input value (or if the parameter is for output only), the recommended approach is to create a Buffer, use the Ptr type to pass it, and use StrGet to retrieve the string after the function returns, as in the wsprintf example.
ja: 関数がパラメータの入力値よりも長い文字列を保存するように設計されている場合（またはパラメータが出力のみの場合）、推奨される方法は、wsprintfの例のように、Bufferを作成し、Ptr型を使ってそれを渡し、関数が戻った後にStrGetを使って文字列を取得する方法です。

source: If the function is specified but the hotkey is disabled from a previous use of this function, the hotkey will remain disabled.
ja: 機能を指定しても、以前にこの機能を使用した際にホットキーが無効になっている場合は、ホットキーは無効のままとなります。

source: If the function name is omitted and the parameter list consists of only a single parameter name, the parentheses can be omitted.
ja: 関数名が省略され、パラメータリストが単一のパラメータ名のみで構成されている場合は、括弧を省略することができます。

source: If the function of a hotkey is ever needed to be called without triggering the hotkey itself, one or more hotkeys can be assigned a named function by simply defining it immediately after the hotkey's double-colon as in this example:
ja: ホットキーの機能を、ホットキー自体をトリガーすることなく呼び出す必要がある場合、この例のように、ホットキーのダブルコロンの直後に定義するだけで、1つまたは複数のホットキーに名前付き機能を割り当てることができます：

source: If the function of a hotstring is ever needed to be called without triggering the hotstring itself, one or more hotstrings can be assigned a named function by simply defining it immediately after the hotstring's double-colon, as in this example:
ja: ホットストリングの関数を、ホットストリング自体をトリガーせずに呼び出す必要がある場合、この例のように、ホットストリングのダブルコロンの直後に関数を定義するだけで、1つまたは複数のホットストリングに名前付き関数を割り当てることができます：

source: If the function returns -1, matching is abandoned.
ja: この関数が-1を返した場合、マッチングは放棄される。

source: If the function returns 0 or does not return a numeric value, matching proceeds as normal.
ja: 関数が0を返すか、数値を返さない場合、マッチングは通常通り行われる。

source: If the function returns 1 or greater, matching fails at the current point, but the testing of other matching possibilities goes ahead.
ja: 関数が1以上を返した場合、マッチングは現在の時点で失敗するが、他のマッチングの可能性のテストは続行される。

source: If the function returns a 32-bit signed integer (Int), BOOL, or nothing at all, ReturnType may be omitted.
ja: 関数が32ビット符号付き整数（Int）、BOOL、または何も返さない場合は、ReturnTypeを省略することができる。

source: If the function returns a value less than -1, it is treated as a PCRE error code and matching is abandoned.
ja: 関数が-1未満の値を返した場合、PCREのエラーコードとして扱われ、マッチングは放棄されます。

source: If the function times out, zero is returned.
ja: 関数がタイムアウトした場合は、0が返されます。

source: If the function uses Return without any parameters, or it specifies a blank value such as "" (or it never uses Return at all), 0 is returned to the caller of the callback.
ja: 関数がパラメータなしでReturnを使用した場合、または "" などの空白の値を指定した場合（あるいは Return を全く使用しなかった場合）、コールバックの呼び出し元には 0 が返されます。

source: If the function writes a new address into the temporary variable, the new string is copied into the script's variable, if a VarRef was passed.
ja: 関数が一時変数に新しいアドレスを書き込むと、VarRefが渡された場合、新しい文字列はスクリプトの変数にコピーされます。

source: If the getter requires parameters, the property is skipped.
ja: ゲッターにパラメータが必要な場合、そのプロパティはスキップされます。

source: If the getter throws an exception, it is propagated (not suppressed).
ja: ゲッターが例外をスローした場合、その例外は伝播される（抑制されない）。
